Wikitutorials/tutorials/incompressible/pimpleFoam/RAS/flowWithOpenBoundary/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

constructFrom  patch;
sourceCase     "$FOAM_CASE";

sourcePatches  (back);
exposedPatchName front;

extrudeModel  plane;
thickness     1;

flipNormals   no;
mergeFaces    no;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
